{
  "backend/main.mo": "Motoko actor that stores and manages four door coating type rates (single, double, doubleSagwanpatti, laminate) with update and query functions for each.",
  "feature_evidence.json": "Feature evidence report confirming that the read-only customer details section (name and mobile) is displayed above DoorEntryForm in the form view of App.tsx.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing the purpose and recent changes of each component, utility, hook, and config file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app titled 'Door Quotation Calculator' that mounts the app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component managing three app views (customerInfo, form, quotation) with state for doors, customer name, and mobile number; the form view renders a read-only customer details card above DoorEntryForm.",
  "frontend/src/components/CustomerInfoForm.tsx": "Start-screen form component that collects and validates customer name and mobile number, then calls an onSubmit callback to advance to the door entry view.",
  "frontend/src/components/CustomKeyboard.tsx": "Fixed-bottom custom numeric keyboard component with a phone-style 3×4 grid plus fraction, decimal, backspace, and Done keys, styled with amber/stone theme.",
  "frontend/src/components/DimensionInput.tsx": "A form component for entering door height and width dimensions (supporting fractional inputs) with a custom on-screen keyboard, validation, and catalogue size lookup.",
  "frontend/src/components/DoorEntryForm.tsx": "A card-based form component that collects door dimensions, validates them against the catalogue, and dispatches a new DoorEntry to the parent via onAddDoor.",
  "frontend/src/components/DoorList.tsx": "Renders a scrollable table of added door entries showing size, per-coating-type pricing, and square footage, with a delete button for each row.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying the copyright year and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "A static header component displaying the app title 'Door Quotation Calculator' with a door emoji icon and subtitle.",
  "frontend/src/components/QuotationView.tsx": "Displays a full quotation breakdown grouped by coating type, with customer info fields and actions for printing or sharing via WhatsApp.",
  "frontend/src/components/RateManager.tsx": "An admin panel component that shows hard-coded coating rates and provides a form to update rates in the backend via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating door coating rates via the backend actor, including `useGetAllCoatingRates`, `useGetCoatingRate`, and `useUpdateCoatingRate`.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, defines CSS custom properties for a warm neutral + amber/gold color palette (light and dark modes), and adds custom utility classes for amber tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/types/door.ts": "Defines TypeScript interfaces and constants for door entries, including `DoorEntry`, `DoorDimension`, coating labels/options/rates, and the catalogue of standard door heights and widths.",
  "frontend/src/utils/dimensionConversion.ts": "Utility functions for converting and formatting door dimensions between inches, fractions, and display strings, plus a `findCatalogueSize` function that rounds actual dimensions up to the nearest catalogue size.",
  "frontend/src/utils/whatsappFormatter.ts": "Formats door quotation data (coating blocks, customer name, mobile) into a URL-encoded WhatsApp message string with door details and grand totals by coating type.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens (amber, sidebar, chart, etc.), custom fonts, border radii, box shadows, and accordion animations.",
  "project_state.json": "Tracks project state at version 3, recording existing features and a pending action request (AR-1) to add a customer details section above the new door entry form."
}