{
  "backend/main.mo": "Motoko actor that stores and manages four coating type rates (single, double, doubleSagwanpatti, laminate) with update and query functions for each rate.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: refactoring dimension inputs to support decimal/fraction formats with stacked layout, and clearing all door entries after WhatsApp share.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's role and recent changes in the app.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing app state (doors, view, customer info), routing between form and quotation views, and passing a `handleClearDoors` callback to `QuotationView` for post-share reset.",
  "frontend/src/components/DimensionInput.tsx": "Dimension input component with vertically stacked full-width height and width fields that accept both decimal and fraction string formats via `parseFractionInput`, with helper text, validation errors, and a catalogue size badge.",
  "frontend/src/components/DoorEntryForm.tsx": "Door entry form card with a dark warm brown background, customer detail fields, stacked dimension inputs, quantity selector, and an '+ Add Door Size' button that validates and appends a door entry.",
  "frontend/src/components/DoorList.tsx": "Renders a list of added door entries with their actual/catalogue sizes, thickness, square footage, quantity, and per-coating pricing, with a remove button for each entry.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with copyright year and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "Renders the app header with a door emoji logo, title 'Door Quotation Calculator', and a subtitle.",
  "frontend/src/components/QuotationView.tsx": "Displays a full quotation view grouped by coating type with per-door line totals, customer info fields, and actions for printing or sharing via WhatsApp.",
  "frontend/src/components/RateManager.tsx": "Admin panel that shows hard-coded coating rates and provides a form to update coating rates on the backend via a select/input and mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching individual and all coating rates from the backend actor, and a mutation hook for updating a coating rate.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Playfair Display fonts, sets up Tailwind directives, and defines a warm neutral/amber OKLCH color token system for both light and dark themes along with custom utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/types/door.ts": "Defines TypeScript interfaces and constants for door data including DoorDimension, DoorEntry, coating labels/options/rates, and the strict catalogue of valid height/width combinations.",
  "frontend/src/utils/dimensionConversion.ts": "Utility functions for converting door dimensions between formats: parsing fraction/decimal input, finding the next-higher catalogue size, calculating square footage, and formatting dimension strings.",
  "frontend/src/utils/whatsappFormatter.ts": "Formats door quotation data into a URL-encoded WhatsApp message string, including per-door details, coating breakdowns, and grand totals grouped by coating type.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based color tokens (including amber/sidebar/chart palettes), custom fonts, border radius, box shadows, and accordion animations.",
  "project_state.json": "Project state document describing the Door Quotation Calculator's architecture, feature list, business rules (catalogue sizes, fixed coating rates, dimension input behavior), and known issues at version 11."
}