{
  "backend/main.mo": "Motoko actor that stores and manages four door coating rates (single, double, doubleSagwanpatti, laminate) with update and query functions for each rate type.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — removing Customer/Mobile columns from DoorList and adding a CustomerInfoForm start screen — to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend source files, describing the purpose and key behavior of each component, hook, utility, and config file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and a module script entry point loading main.tsx.",
  "frontend/src/App.tsx": "Root app component managing three views (customerInfo → form → quotation), storing customer name/mobile in state, and orchestrating door list state with add, remove, and clear handlers.",
  "frontend/src/components/CustomerInfoForm.tsx": "Start-screen card form that collects and validates customer name and mobile number, then calls an onSubmit callback to advance the app flow to door entry.",
  "frontend/src/components/CustomKeyboard.tsx": "Fixed-bottom phone-style numeric keypad component with keys for digits 0–9, fraction slash, decimal point, backspace, and a Done button styled with the amber/stone theme.",
  "frontend/src/components/DimensionInput.tsx": "A controlled input component for door height and width dimensions that supports fraction input, displays a custom on-screen keyboard, and shows catalogue size matching feedback.",
  "frontend/src/components/DoorEntryForm.tsx": "A form component that collects door height and width, maps them to a catalogue size, and adds a new DoorEntry to the quotation via a callback.",
  "frontend/src/components/DoorList.tsx": "Renders a scrollable table of added door entries showing per-coating-type pricing and square footage, with a delete button for each row.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying the copyright year and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "A static header component displaying the app title 'Door Quotation Calculator' with a door emoji icon and subtitle.",
  "frontend/src/components/QuotationView.tsx": "Displays a full quotation broken down by coating type with per-door line items, totals, customer info fields, and actions for printing or sharing via WhatsApp.",
  "frontend/src/components/RateManager.tsx": "An admin panel component that shows hard-coded coating rates and provides a form to update backend coating rates via an API mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating door coating rates from the backend actor, including queries for individual and all coating rates plus a mutation to update them.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS layers, defines CSS custom properties for a warm neutral/amber color palette (light and dark modes), and adds utility classes for amber accent colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/door.ts": "Defines TypeScript interfaces and constants for door dimensions, catalogue sizes, coating types, labels, options, and fixed coating rates used throughout the app.",
  "frontend/src/utils/dimensionConversion.ts": "Utility functions for converting door dimensions between inches/fractions/strings and finding the nearest catalogue size using a round-up algorithm.",
  "frontend/src/utils/whatsappFormatter.ts": "Formats door quotation data (coating blocks, customer info) into a URL-encoded WhatsApp message string with door details and grand totals by coating type.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, typography, border radius, box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state and feature requests for a React Native app refactor that moves customer name/mobile collection to an initial screen and removes those columns from the DoorList table. Contains two implemented features (REQ-1, REQ-2) at schema version 1.0.0."
}