{
  "kind": "build_request",
  "title": "Move customer name & mobile form to app start screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Customer and Mobile columns from the DoorList table. The door entries table should only show Sr, Size, and pricing columns — no customer/mobile data displayed per row.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove form here add in starting"
        ]
      },
      "acceptanceCriteria": [
        "DoorList table no longer renders Customer or Mobile columns",
        "Table header row does not include Customer or Mobile headings",
        "Each door entry row only shows Sr, Size, and coating price columns"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a customer info entry screen at the very beginning of the app flow (before the door entry form). This screen should collect the customer name and mobile number with two text input fields and a 'Continue' or 'Start' button. Only after submitting this screen should the user proceed to the door dimension entry and door list view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove form here add in starting"
        ]
      },
      "acceptanceCriteria": [
        "On first load, a customer info screen is shown with fields for customer name and mobile number",
        "User cannot reach the door entry form until they submit the customer info screen",
        "Submitting the customer info screen stores the name and mobile in app state and navigates to the door entry / door list view",
        "The stored customer name and mobile number are still passed through to the quotation view and WhatsApp share output"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui/",
    "Customer name and mobile number must still be available in the quotation/WhatsApp output"
  ],
  "nonGoals": [
    "Changing backend schema or Motoko actor",
    "Adding authentication or login",
    "Redesigning the door entry form layout"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}